In [70]:
import pandas as pd
import statsmodels.formula.api as sm
from statsmodels.sandbox.regression.predstd import wls_prediction_std
from sklearn import preprocessing
from sklearn.preprocessing import scale, robust_scale, minmax_scale, maxabs_scale
from pandas import ExcelWriter
from pandas import ExcelFile

In [71]:
chicken = pd.read_excel('testt.xlsx',header=None)

In [72]:
chicken

     0       1      2  3  4  5  6
0  216  230801  19490  0  0  1  0
1  216  230801  18269  0  0  1  0
2  216  230801  20895  0  0  1  0
3  216  230801   6384  0  0  0  1
4  216  230801   5859  0  0  0  1
5  216  230801   6290  0  0  0  1

In [73]:
chicken.columns = ["total_number", "house", "call", "morning", "lunch", "dinner","yasik"]

In [74]:
chicken

   total_number   house   call  morning  lunch  dinner  yasik
0           216  230801  19490        0      0       1      0
1           216  230801  18269        0      0       1      0
2           216  230801  20895        0      0       1      0
3           216  230801   6384        0      0       0      1
4           216  230801   5859        0      0       0      1
5           216  230801   6290        0      0       0      1

In [75]:
chicken['call_for_onestore'] = chicken['call']/chicken['total_number']
chicken['월'] = ["8월","9월","10월","8월","9월","10월"]

In [76]:
chicken = chicken[['월','total_number','house','call','morning','lunch','dinner','yasik','call_for_onestore']]

In [77]:
chicken

,월,total_number,house,call,morning,lunch,dinner,yasik,call_for_onestore
0,8월,216,230801,19490,0,0,1,0,90.231481
1,9월,216,230801,18269,0,0,1,0,84.578704
2,10월,216,230801,20895,0,0,1,0,96.736111
3,8월,216,230801,6384,0,0,0,1,29.555556
4,9월,216,230801,5859,0,0,0,1,27.125000
5,10월,216,230801,6290,0,0,0,1,29.120370

In [83]:
# 치킨, 송파구, 저녁 & 야식
a = 1
b = 0
c = 0
d = 1
e = 1
f = 0.652174

In [84]:
# following our regression model
result = 23 + 22*a -25*b -9*c + 56*d +2*e -21*f

In [85]:
result

89.304346

In [86]:
from sklearn.metrics import mean_squared_error
from math import sqrt
# 위에 표에서 10월 데이터 dinner + yasik = 125.856
y_actual = [125.856]
# y_predicted는 모델을 통해 나온 result = 89.304346
y_predicted = [result]
rms = sqrt(mean_squared_error(y_actual, y_predicted))

In [87]:
print(rms)

36.551654